#საყვარელი ფერები
colors = ["წითელი", "ლურჯი", "მწვანე", "შავი", "თეთრი"]
print("ფერები:", colors)

#კვირის დღეები
days = ["ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი", "პარასკევი", "შაბათი", "კვირა"]
print("დღეები:", days)

#რიცხვი + მესამე ინდექსი
nums1 = [10, 20, 30, 40, 50]
print("მესამე ინდექსი:", nums1[3])

#ქალაქები + შეცვლა
cities = ["თბილისი", "ბათუმი", "ქუთაისი", "ზუგდიდი", "რუსთავი"]
cities[2] = "გორი"
print("ქალაქები:", cities)

#ოჯახის წევრები
family = ["მამა", "დედა", "ძმა", "და"]
print("პირველი:", family[0])
print("ბოლო:", family[-1])

#რიცხვი + შეცვლა
nums2 = [1, 2, 3, 4, 5, 6]
nums2[4] = 100
print("შეცვლილი სია:", nums2)

#ძაღლების სახელები
dogs = ["ბობი", "რექსი", "ჯეკი", "მაქსი", "ლეო", "ტობი", "კოკო", "ბრუნო", "ლუკა", "როკი"]
dogs[4] = "ზევსი"
print("ძაღლები:", dogs)

#სხვადასხვა ტიპები
data = ["გიორგი", "ანა", "ლუკა", 10, 20, 30, True, False, True]
print("ერთი ელემენტი:", data[2])

#მუსიკოსები
musicians = ["Drake", "Eminem", "Travis Scott", "Kanye West", "50 Cent"]
if musicians[0] == "Drake":
    musicians[0] = "The Weeknd"
print("მუსიკოსები:", musicians)

#რიცხვები + 1000 დამატება
nums3 = [10, 2.5, 30, 4.7, 50]
nums3[0] += 1000
nums3[-1] += 1000
print("გაზრდილი სია:", nums3)

#პირობითი ამოცანა
nums4 = [12, 3, 4]

if nums4[0] > 10:
    nums4[2] += nums4[0] * nums4[1]
else:
    nums4[0] += nums4[1] * nums4[2]

print("საბოლოო შედეგი:", nums4)